Public Attributes | List of all members
API_CompositeId Struct Reference
Element Manager API
Identifies the composite skin and sub-element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Guid  | subElementGuid
GUID of the sub-element, or APINULLGuid if no sub-element is attached to the component.
Detailed Description
Identifies the composite skin and sub-element.
Member Data Documentation
◆ subElementGuid
 API_CompositeId::subElementGuid
GUID of the sub-element, or APINULLGuid if no sub-element is attached to the component.